#ifndef _DWiME3RD_H_
#define _DWiME3RD_H_

#include "splime.h"


#ifdef WIN32
    #include <stdlib.h>
    typedef wchar_t			LDChar;
#else
    typedef unsigned short	LDChar;
#endif

#ifndef NULL
#define NULL		0
#endif


#ifdef __cplusplus
extern "C" {
#endif


//---------------------------------------------------------------------
// 设置记忆数据库
//
// 参数：
//		data		记忆数据库的数据指针，如果是动态内存用完，自行释放
// 返回：
//		无
//
//---------------------------------------------------------------------
void DWIME3rd_SetUserDB(void * data);


//---------------------------------------------------------------------
// 初始化输入法
//
// 参数：
//		lang		语言，进入查看splime.h 类型定义
//		kbType		键盘类型 进入查看splime.h 类型定义
//		im			输入模式，进入查看splime.h 类型定义
//		data		词库数据
// 返回：
//		成功返回0
//
//---------------------------------------------------------------------
int DWIME3rd_Open(enum SPLanguage lang, enum KeyBoardType kbType, enum InputMode im, const  void * data);

int DWIME3rd_OpenKO();		// 韩语初始化调用这个就不需要用DWIME3rd_Open了;

int DWIME3rd_OpenJP();		// 日语初始化调用这个就不需要用DWIME3rd_Open了;

int DWIME3rd_OpenPY(enum KeyBoardType kbType);		// 拼音初始化调用这个就不需要用DWIME3rd_Open了;
int DWIME3rd_OpenPY26();
int DWIME3rd_OpenPY9();

int DWIME3rd_OpenSK();		// 笔画初始化调用这个就不需要用DWIME3rd_Open了;

int DWIME3rd_OpenWB();		// 五笔初始化调用这个就不需要用DWIME3rd_Open了;

//---------------------------------------------------------------------
// 关闭输入法
//
// 参数：
//		无
// 返回：
//		成功返回0
//---------------------------------------------------------------------
int DWIME3rd_Close();



//---------------------------------------------------------------------
// 重置输入法
//
// 参数：
//		无
// 返回：
//		成功返回0
//---------------------------------------------------------------------
int DWIME3rd_Reset();



//---------------------------------------------------------------------
// 传一个按键进入引擎内
//
// 参数：
//		key 		键值，进入查看splime.h 类型定义
// 返回：
//		成功返回0
//---------------------------------------------------------------------
int DWIME3rd_KeyPress(enum SplKey key);


//---------------------------------------------------------------------
// 查询当前是否有按键输入到引擎里
//
// 参数：
//		无
// 返回：
//		有1，无0
//
//---------------------------------------------------------------------
int DWIME3rd_HasInput();



//---------------------------------------------------------------------
// 查询当前是不是联想状态
//
// 参数：
//		无
// 返回：
//		是1，否0
//
//---------------------------------------------------------------------
int DWIME3rd_IsAsseMode();




//---------------------------------------------------------------------
// 查询当前候选结果的数量
//
// 参数：
//		无
// 返回：
//		返回数量
//
//---------------------------------------------------------------------
int DWIME3rd_ResultCount();




//---------------------------------------------------------------------
// 反馈一个索引给引擎，告诉引擎用户选择了第几个候选结果
//
// 参数：
//		index		候选结果索引
// 返回：
//		成功1，失败0
//
//---------------------------------------------------------------------
int DWIME3rd_SelectResult(int index);


//---------------------------------------------------------------------
// 选择一个音节(九宫格拼音，或九宫格英文)
//
// 参数：
//		index		音节索引
// 返回：
//		成功0，其它失败
//
//---------------------------------------------------------------------
int DWIME3rd_SelectSyllable(int index);


//---------------------------------------------------------------------
// 查询是否有结果要输出
//
// 参数：
//		无
// 返回：
//		有1，无0
//
//---------------------------------------------------------------------
int DWIME3rd_IsCanCommit();



//---------------------------------------------------------------------
// 获取要输出的字符串
//
// 参数：
//		pOutStr		输出候选字符串
//		bufferLen	pOutStr数组长度
// 返回：
//		返回字符串的长度
//
//---------------------------------------------------------------------
int DWIME3rd_CommitString(LDChar * pOutStr, int bufferLen);



//---------------------------------------------------------------------
// 从引擎里获取一个候选结果字符串
//
// 参数：
//		index		候选结果索引
//		pOutStr		输出候选字符串
//		bufferLen	pOutStr数组长度
// 返回：
//		返回字符串的长度
//
//---------------------------------------------------------------------
int DWIME3rd_ResultString(int index, LDChar * pOutStr, int bufferLen);




//---------------------------------------------------------------------
// 获取当前的输入内容
//
// 参数：
//		pOutStr		输出候选字符串
//		bufferLen	pOutStr数组长度
// 返回：
//		返回字符串的长度
//
//---------------------------------------------------------------------
int DWIME3rd_InputString(LDChar * pOutStr, int bufferLen);




//---------------------------------------------------------------------
// 格式化拼音
//
// 参数：
//		candIndex   格式化输入串是和候选关联的，所以要指定针对第几个候选进行格式化。
//		pOutStr		输出候选字符串
//		bufferLen	pOutStr数组长度
// 返回：
//		返回字符串的长度
//
//	举例说明：输入内容为 xian，候选结果为：西安 现 ... ... ... ...
//
//		1、调用本函数 candIndex为0，即针对“西安”格式化结果为 xi'an
//		2、调用本函数 candIndex为1，即针对“现”格式化结果为 xian
//
//---------------------------------------------------------------------
int DWIME3rd_FormatPY(int candIndex, LDChar * pOutStr, int bufferLen);



//---------------------------------------------------------------------
//  DWIME3rd_HwAssociate
//
//  手写联想(需要初始化键盘输入法如：拼音)
//
//  pAssKey		联想关键字
//
//	成功返回结果数量，失败返回 0
//
//---------------------------------------------------------------------
int DWIME3rd_HwAssociate(const LDChar * pAssKey);



#ifdef __cplusplus
}
#endif


#endif
